БИТУправление_медицинским_центром_демо/src/InformationRegisters/МашиночитаемыеДоверенности/МашиночитаемыеДоверенности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МашиночитаемыеДоверенности</name>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаКонца</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/МашиночитаемыеДоверенности/ManagerModule.bsl
// Возвращает уникальный идентификатор первой актуальной МЧД пользователя
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи	 - Пользвоатель
// 
// Возвращаемое значение:
//  Строка, Неопределено - строка УИД, если действующая МЧД найдена, иначе Неопределено 
//
Функция ПолучитьУИДМЧД(ОГРН, Пользователь = Неопределено) Экспорт
	
	Пользователь = ?(Пользователь = Неопределено, ПараметрыСеанса.ТекущийПользователь, Пользователь);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Организации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.ОГРН = &ОГРН
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Организации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ОГРН", Строка(Формат(ОГРН,"ЧГ=0")));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	МашиночитаемыеДоверенности.УИД КАК УИД
		               |ИЗ
		               |	РегистрСведений.МашиночитаемыеДоверенности КАК МашиночитаемыеДоверенности
		               |ГДЕ
		               |	МашиночитаемыеДоверенности.Пользователь = &Пользователь
		               |	И &Дата МЕЖДУ МашиночитаемыеДоверенности.ДатаНачала И МашиночитаемыеДоверенности.ДатаКонца
		               |	И МашиночитаемыеДоверенности.Организация = &Организация
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	МашиночитаемыеДоверенности.ДатаНачала";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Запрос.УстановитьПараметр("Организация", Выборка.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.УИД;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции
